In [7]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data/sqlite-sakila.db')
db = conn.cursor()

1. start with a simple one, get the best rental DVD
- use rental r join payment p on r.rental_id = p.rental_id
- group by the inventoryid and sum the amount
- can use subquery to get the name of the inventory by new_table join inventory on n.inventory_id=i.inventory_id
- the table should have 3 columns, inventoryid, name of the movie, amount of sale

problem:
- I have to merge another table with inventory to get film title from inventory
- I cannot rename a new_table name again using as eg (...) as new_table n is not allowed
- I misunderstood the inventory id here, it is not uniqle for each movie, lets try it again in q2
- understanding the flow of the tables is very <font size="5" color=green>IMPORTANT</font>
- I accidentally deleted a cell... use EDIT RECOVER DELETED CELL to recover

In [24]:
db.execute(    
'''select new_table.*,f.title
from (
select r.inventory_id, sum(p.amount) as revenue
from rental r join payment p on r.rental_id = p.rental_id
group by r.inventory_id
order by revenue desc
limit 20) as new_table join inventory i on new_table.inventory_id=i.inventory_id join film f on i.film_id = f.film_id

''')
rows = db.fetchall()
pd.DataFrame(rows,columns=['invenotry_id','sales','name of movies'])

    invenotry_id  sales       name of movies
0           4030  46.95          TEEN APOLLO
1            103  45.95      AMERICAN CIRCUS
2            946  44.95         DARKO DORADO
3            214  44.95  BACKLASH UNDEFEATED
4           3969  43.95       SUNRISE LEAGUE
5           3049  42.95     PELICAN COMFORTS
6           1496  42.95     FOOL MOCKINGBIRD
7            971  42.95       DAY UNFAITHFUL
8           4451  41.95            WIFE TURN
9           4034  41.95     TELEGRAPH VOYAGE
10          4029  41.95          TEEN APOLLO
11          3741  41.95       SOMETHING DUCK
12          3627  41.95            SHOW LORD
13           578  41.95    CASUALTIES ENCINO
14          3489  40.95       SATURDAY LAMBS
15          2656  40.95    MISSION ZOOLANDER
16          2306  40.95        KISSING DOLLS
17          1494  40.95     FOOL MOCKINGBIRD
18           288  40.95     BEHAVIOR RUNAWAY
19           213  40.95  BACKLASH UNDEFEATED

2. CONT. lets get the best sales by name from the first query
- I can reuse the previous query and change accordingly and group by the name again
problem:
- <font size=5 color=red>CAREFUL</font> In the subquery always be careful using limit, if limit is used in subquery (eg 10 rows here), the main query will only look at 10 rows instead of entire subquery

In [27]:
db.execute(    
'''select f.title, sum(new_table.revenue) as real_revenue
from (
select r.inventory_id, sum(p.amount) as revenue
from rental r join payment p on r.rental_id = p.rental_id
group by r.inventory_id
order by revenue desc) as new_table 
join inventory i on new_table.inventory_id=i.inventory_id 
join film f on i.film_id = f.film_id
group by f.title
order by real_revenue desc
limit 10
''')
rows = db.fetchall()
pd.DataFrame(rows,columns=['name of movies','sale'])

      name of movies    sale
0   TELEGRAPH VOYAGE  231.73
1          WIFE TURN  223.69
2          ZORRO ARK  214.69
3  GOODFELLAS SALUTE  209.69
4     SATURDAY LAMBS  204.72
5        TITANS JERK  201.71
6       TORQUE BOUND  198.72
7        HARRY IDAHO  195.70
8     INNOCENT USUAL  191.74
9      HUSTLER PARTY  190.78

3. which actors issued the most movies with names of the actor
- first get each actor id and count the number of film id
- join with the actor with actor_id

In [35]:
db.execute(    
'''select (a.first_name||' '||a.last_name) as Name,numner_cast
from
(
select actor_id,count(distinct(film_id)) as numner_cast
from film_actor
group by actor_id
) as new_table join actor a on new_table.actor_id=a.actor_id
order by numner_cast desc
limit 10
''')
rows = db.fetchall()
pd.DataFrame(rows,columns=['Name','number_of_cast'])

             Name  number_of_cast
0  GINA DEGENERES              42
1     WALTER TORN              41
2     MARY KEITEL              40
3  MATTHEW CARREY              39
4   SANDRA KILMER              37
5  SCARLETT DAMON              36
6        UMA WOOD              35
7      VAL BOLGER              35
8     HENRY BERRY              35
9   GROUCHO DUNST              35

4. Best performing store and the number of staff
- join staff store on staff.store_id = store.store_id
- join staff payment on staff.staff_id = payment.staff_id
- group by store id in staff sum(payment.amount) count(distinct(staff_id))

problem:
- hmm there are only 2 store with 2 staff, the information seems to be irrelavent

In [45]:
db.execute(    
'''
select s.store_id,sum(p.amount) as revenue,count(distinct(s.staff_id)) as number_staff
from staff s join store st on s.store_id=st.store_id
join payment p on s.staff_id=p.staff_id
group by s.store_id
''')
rows = db.fetchall()
pd.DataFrame(rows,columns=['store_id','revenue','number_staff'])

   store_id   revenue  number_staff
0         1  33489.47             1
1         2  33927.04             1

5. which film category is the most famous
- adopt the query from q2 and group by the genre of the movie instead of the name of the movie
- film_category contain the genre as category_id and film_id and category contain the category_id and name
- lets try to merge q2 with this query to solve the issue

In [63]:
db.execute(    
'''
select lookuptable.name,sum(real_revenue) as genre_revenue
from (
    select f.title,f.film_id as filmid, sum(new_table.revenue) as real_revenue
    from (
        select r.inventory_id, sum(p.amount) as revenue
        from rental r join payment p on r.rental_id = p.rental_id
        group by r.inventory_id
        order by revenue desc) as new_table 
        join inventory i on new_table.inventory_id=i.inventory_id 
        join film f on i.film_id = f.film_id
        group by f.title
        order by real_revenue desc) as main_table join

        (select fc.film_id as filmid,cy.name
        from film_category fc join category cy on fc.category_id=cy.category_id) as lookuptable 
        on main_table.filmid = lookuptable.filmid
group by lookuptable.name
order by genre_revenue desc
''')
rows = db.fetchall()
pd.DataFrame(rows, columns=['Genre','revenue'])

          Genre  revenue
0        Sports  5314.21
1        Sci-Fi  4756.98
2     Animation  4656.30
3         Drama  4587.39
4        Comedy  4383.58
5        Action  4375.85
6           New  4351.62
7         Games  4281.33
8       Foreign  4270.67
9        Family  4226.07
10  Documentary  4217.52
11       Horror  3722.54
12     Children  3655.55
13     Classics  3639.59
14       Travel  3549.64
15        Music  3417.72

In [10]:
!git add Untitled1.ipynb
!git commit -m 'added another database for testing'
!git push origin master

[master 06e3b2d] added another database for testing
 1 file changed, 81 insertions(+)
 create mode 100644 Untitled1.ipynb
Enumerating objects: 4, done.
Counting objects: 100% (4/4), done.
Delta compression using up to 20 threads
Compressing objects: 100% (3/3), done.
Writing objects: 100% (3/3), 1.08 KiB | 1.08 MiB/s, done.
Total 3 (delta 0), reused 0 (delta 0)
To github.com:Aipeni/sql_playgorund.git
   478ba57..06e3b2d  master -> master